"""
Сумма простых чисел меньше 10 равна 2 + 3 + 5 + 7 = 17.
Найдите сумму всех простых чисел меньше двух миллионов.
https://euler.jakumo.org/problems/view/10.html

The sum of the primes below 10 is 2 + 3 + 5 + 7 = 17.
Find the sum of all the primes below two million.
https://projecteuler.net/problem=10
"""


def _main(N: int) -> int:
    """Возвращает сумму простых чисел"""
    pass


if __name__ == "__main__":
    print(_main(10))
